""" Задача 2: Найдите сумму цифр трехзначного числа.
    123 -> 6 (1 + 2 + 3)
    100 -> 1 (1 + 0 + 0) """

n = int(input('Введите трехзначное число: ')) 
a = n // 100
n1 = n % 100
b = n1 // 10
c = n1 % 10
print(a + b + c)